app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title") VALUES (?)  [["title", "Software Engineering"]]
---
  def create
    @school_class = SchoolClass.create(title: params[:school_class_title], room_number: [:school_class_room_number])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by_id(params[:id])
    @school_class.update(params[:school_class])