app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2018-09-04 20:29:19.110956"], ["updated_at", "2018-09-04 20:29:19.110956"]]
---
  def create
    @student = Student.create(first_name: params[:first_name], last_name: params[:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @student = Student.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-04 20:29:19.139633"], ["id", 1]]
---
  def update
    @student = Student.find_by_id(params[:id])
    @student.update(params[:student])